app/controllers/api/auth_controller.rb

    def signup
      user = User.new(signup_params)

      if user.save
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"