app/controllers/api/sessions_controller.rb

    def create
      qr_code = QrCode.find_by(short_id: params[:qr_code_short_id])

      return render json: { error: 'QR code not found' }, status: :not_found unless qr_code
      return render json: { error: 'QR code has expired' }, status: :unprocessable_entity if qr_code.expired?
      return render json: { error: 'Device token required' }, status: :unprocessable_entity unless params[:device_token]

      athlete = User.find(params[:athlete_id]) if params[:athlete_id]
      device_token_obj = register_or_update_device_token(athlete)

      qr_scan = qr_code.qr_scans.build(athlete_id: device_token_obj.user_id, scanned_at: Time.current)

      unless qr_scan.save
        return render json: { error: 'Failed to record scan', details: qr_scan.errors }, status: :unprocessable_entity
      end

      workout_session = WorkoutSession.create!(
        qr_scan_id: qr_scan.id,
        athlete_id: device_token_obj.user_id,
        workout_id: qr_code.workout_id,
        started_at: Time.current
      )
---
SELECT "qr_codes".* FROM "qr_codes" WHERE "qr_codes"."short_id" = $1 LIMIT $2  [["short_id", "92da7343342a5485"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 300], ["LIMIT", 1]]
INSERT INTO "device_tokens" ("user_id", "token", "platform", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 300], ["token", "[FILTERED]"], ["platform", 0], ["expires_at", "2026-06-12 00:25:25.886094"], ["created_at", "2026-03-14 00:25:25.892537"], ["updated_at", "2026-03-14 00:25:25.892537"]]
INSERT INTO "qr_scans" ("qr_code_id", "athlete_id", "scanned_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["qr_code_id", 31], ["athlete_id", 300], ["scanned_at", "2026-03-14 00:25:25.899749"], ["created_at", "2026-03-14 00:25:25.903512"], ["updated_at", "2026-03-14 00:25:25.903512"]]
INSERT INTO "workout_sessions" ("qr_scan_id", "athlete_id", "workout_id", "started_at", "completed_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"