app/controllers/api/workouts_controller.rb

    def create
      workout = current_user.workouts.build(workout_params)

      if workout.save
---
INSERT INTO "workouts" ("coach_id", "name", "blocks", "status", "version", "is_public", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def update
      return render json: { error: 'Cannot update published workout' }, status: :unprocessable_entity if @workout.status_published?

      if @workout.update(workout_params)
---
UPDATE "workouts" SET "name" = $1, "blocks" = $2, "updated_at" = $3 WHERE "workouts"."id" = $4  [["name", "Updated Name"], ["blocks", "[]"], ["updated_at", "2026-03-14 00:24:16.641113"], ["id", 88]]

    def publish
      return render json: { error: 'Already published' }, status: :unprocessable_entity if @workout.status_published?
      return render json: { error: 'Cannot publish empty workout' }, status: :unprocessable_entity if @workout.blocks.blank?

      if @workout.update(status: :published)
---
UPDATE "workouts" SET "status" = $1, "updated_at" = $2 WHERE "workouts"."id" = $3  [["status", 1], ["updated_at", "2026-03-14 00:23:33.502183"], ["id", 38]]

    def qr
      return render json: { error: 'Must publish before generating QR' }, status: :unprocessable_entity unless @workout.status_published?

      qr_code = @workout.qr_codes.build(qr_params)

      if qr_code.save
---
INSERT INTO "qr_codes" ("workout_id", "short_id", "variant", "expires_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["workout_id", 45], ["short_id", "a466b1c4d8599ae0"], ["variant", 0], ["expires_at", nil], ["created_at", "2026-03-14 00:23:33.578325"], ["updated_at", "2026-03-14 00:23:33.578325"]]

    def find_workout
      @workout = Workout.find(params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]